bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
// UI layout constants
static const int HEADER_HEIGHT = 50;
static const int POWER_BUTTON_SIZE = 40;
static const int SERVICE_BUTTON_MARGIN = 10;
static const int SERVICE_BUTTON_HEIGHT = 55;
static const int URL_CHARS_PER_LINE = 45;         // Characters per line when wrapping URLs
static const int URL_MAX_LINES = 3;               // Maximum lines for URL display
static const unsigned long DISPLAY_AUTO_REFRESH_MS = 5000; // Auto-refresh interval for main view

// Function prototypes for LCD
void initDisplay();
void renderMainView();
void renderDetailView();
void handleDisplayLoop();
void handleMainViewTouch(int16_t x, int16_t y);
void handleDetailViewTouch(int16_t x, int16_t y);
void handleScreenOffTouch(int16_t x, int16_t y);
void turnScreenOff();
void turnScreenOn();
void recordActivity();
#endif // HAS_LCD

// RGB LED Status Indicator
// Uses the built-in RGB LED on ESP32-S3 DevKitC (GPIO 48)
// LED states indicate system and service health at a glance

enum LedStatus {
  LED_STATUS_BOOTING,      // Blue pulsing - system booting, no checks yet
  LED_STATUS_NO_WIFI,      // Orange - no WiFi connection
  LED_STATUS_MESHCORE,     // White - communicating with MeshCore radio
  LED_STATUS_ALL_UP,       // Green pulsing - all services are UP
  LED_STATUS_ANY_DOWN,     // Red pulsing - one or more services are DOWN
  LED_STATUS_PAUSED_DOWN   // Orange pulsing - paused services are DOWN
};

// Current LED state
static LedStatus currentLedStatus = LED_STATUS_BOOTING;
static unsigned long lastLedUpdate = 0;
static bool ledPulseDirection = true;  // true = brightening, false = dimming
static uint8_t ledBrightness = 0;

// LED pulsing parameters
const unsigned long LED_PULSE_INTERVAL_MS = 20;  // Update interval for smooth pulsing
const uint8_t LED_PULSE_STEP = 5;               // Brightness change per step
const uint8_t LED_MAX_BRIGHTNESS = 100;         // Max brightness (0-255)
const uint8_t LED_MIN_BRIGHTNESS = 5;           // Min brightness for pulsing

// Update RGB LED based on current status
void updateLed() {
  if (!LED_ENABLED) {
    // If LED is disabled, turn it off
    neopixelWrite(RGB_BUILTIN, 0, 0, 0);
    return;
  }

  unsigned long now = millis();
  
  // Only update at the pulse interval for smooth animation
  if (now - lastLedUpdate < LED_PULSE_INTERVAL_MS) {
    return;
  }
  lastLedUpdate = now;

  // Calculate pulsing brightness for states that pulse
  bool shouldPulse = (currentLedStatus == LED_STATUS_BOOTING ||
                      currentLedStatus == LED_STATUS_ALL_UP ||
                      currentLedStatus == LED_STATUS_ANY_DOWN ||
                      currentLedStatus == LED_STATUS_PAUSED_DOWN);
  
  if (shouldPulse) {
    if (ledPulseDirection) {
      ledBrightness += LED_PULSE_STEP;
      if (ledBrightness >= LED_MAX_BRIGHTNESS) {
        ledBrightness = LED_MAX_BRIGHTNESS;
        ledPulseDirection = false;
      }
    } else {
      if (ledBrightness > LED_PULSE_STEP + LED_MIN_BRIGHTNESS) {
        ledBrightness -= LED_PULSE_STEP;
      } else {
        ledBrightness = LED_MIN_BRIGHTNESS;
        ledPulseDirection = true;
      }
    }
  } else {
    // Non-pulsing states use steady brightness
    ledBrightness = LED_MAX_BRIGHTNESS;
  }

  // Set color based on status
  uint8_t r = 0, g = 0, b = 0;
  
  switch (currentLedStatus) {
    case LED_STATUS_BOOTING:
      // Blue pulsing
      b = ledBrightness;
      break;
    case LED_STATUS_NO_WIFI:
      // Orange (steady)
      r = ledBrightness;
      g = ledBrightness / 3;  // Orange = red + some green
      break;
    case LED_STATUS_MESHCORE:
      // White (steady)
      r = ledBrightness;
      g = ledBrightness;
      b = ledBrightness;
      break;
    case LED_STATUS_ALL_UP:
      // Green pulsing
      g = ledBrightness;
      break;
    case LED_STATUS_ANY_DOWN:
      // Red pulsing
      r = ledBrightness;
      break;
    case LED_STATUS_PAUSED_DOWN:
      // Orange pulsing - paused services are DOWN
      r = ledBrightness;
      g = ledBrightness / 3;  // Orange = red + some green
      break;
  }

  neopixelWrite(RGB_BUILTIN, r, g, b);
}

// Set LED status and reset pulse state for smooth transition
void setLedStatus(LedStatus status) {
  if (currentLedStatus != status) {
    currentLedStatus = status;
    // Reset pulse for new status
    ledBrightness = LED_MIN_BRIGHTNESS;
    ledPulseDirection = true;
    // Immediate update
    lastLedUpdate = 0;
    updateLed();
  }
}

bool isNtfyConfigured() {
  return strlen(NTFY_TOPIC) > 0;
}

bool isDiscordConfigured() {
  return strlen(DISCORD_WEBHOOK_URL) > 0;
}

bool isSmtpConfigured() {
  return strlen(SMTP_SERVER) > 0 && strlen(SMTP_FROM_ADDRESS) > 0 &&
         strlen(SMTP_TO_ADDRESS) > 0;
}

bool isMeshCoreConfigured() {
#ifdef HAS_LORA_RADIO
  // For LoRa mode, MeshCore is configured if channel name is set
  return strlen(BLE_MESH_CHANNEL_NAME) > 0;
#else
  // For BLE mode, MeshCore is configured if peer name is set AND (channel OR room server is set)
  return strlen(BLE_PEER_NAME) > 0 && 
         (strlen(BLE_MESH_CHANNEL_NAME) > 0 || strlen(BLE_MESH_ROOM_SERVER_ID) > 0);
#endif
}

bool isMeshChannelConfigured() {
  return strlen(BLE_MESH_CHANNEL_NAME) > 0;
}

bool isMeshRoomServerConfigured() {
  return strlen(BLE_MESH_ROOM_SERVER_ID) > 0;
}

void sendNtfyNotification(const String& title, const String& message, const String& tags = "warning,monitor");
void sendDiscordNotification(const String& title, const String& message);
void sendSmtpNotification(const String& title, const String& message);
void sendMeshCoreNotification(const String& title, const String& message);
void initMeshCore();
void disconnectMeshCore();
void disconnectWiFi();
void reconnectWiFi();

AsyncWebServer server(80);

// MeshCore Protocol Stack (layered architecture)
// The transport layer varies based on hardware:
// - BLE mode (default): BLECentralTransport connects to external MeshCore device
// - LoRa mode (HAS_LORA_RADIO): LoRaTransport uses built-in SX1262 radio
#ifdef HAS_LORA_RADIO
static LoRaTransport* meshTransport = nullptr;
static FrameCodec* meshCodec = nullptr;
// In LoRa mode, messages are sent directly - no companion protocol needed
// The LoRa radio is always "connected" once initialized
#else
// Layer 1: BLE Transport - handles BLE connection and I/O
// Layer 2: Frame Codec - handles frame parsing/building  
// Layer 3: Companion Protocol - handles MeshCore protocol logic
static BLECentralTransport* meshTransport = nullptr;
static FrameCodec* meshCodec = nullptr;
static CompanionProtocol* meshProtocol = nullptr;
#endif

// BLE/WiFi coexistence - ESP32-S3 cannot run WiFi and BLE simultaneously
// This is not needed for LoRa mode since LoRa and WiFi can coexist
bool bleOperationInProgress = false;
bool monitoringPaused = false;

// Minimum valid Unix timestamp for NTP validation (2021-01-01 00:00:00 UTC)
// Used to detect if time has been properly synchronized via NTP
const time_t MIN_VALID_TIMESTAMP = 1609459200;

