bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // Check services every 5 seconds
  if (currentTime - lastCheckTime >= 5000) {
    checkServices();
    lastCheckTime = currentTime;
    if (serviceCount > 0) {
      hasPerformedChecks = true;
    }
  }

  // Process notification queue for failed notifications (WiFi-based)
  processNotificationQueue();
  
  // Process MeshCore queue separately (batched, 10 minute interval)
  processMeshCoreQueue();
  
  // Handle OTA update events
  ElegantOTA.loop();

#ifdef HAS_LCD
  // Handle LCD display updates and touch input
  handleDisplayLoop();
#endif

  delay(10);
}

void initWiFi() {
  Serial.println("Connecting to WiFi...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
    // Update LED during WiFi connection attempts
    updateLed();
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi connected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
    
    // Synchronize time via NTP - required for MeshCore message timestamps
    // Uses UTC (gmtOffset=0, daylightOffset=0) for consistent Unix timestamps
    Serial.println("Synchronizing time via NTP...");
    configTime(0, 0, "pool.ntp.org", "time.nist.gov");
    
    // Wait for time to be set (with timeout)
    // Blocking is acceptable here since web server hasn't started yet
    time_t now = 0;
    int ntpAttempts = 0;
    while (now < MIN_VALID_TIMESTAMP && ntpAttempts < 10) {
      delay(500);
      time(&now);
      ntpAttempts++;
    }
    
    if (now >= MIN_VALID_TIMESTAMP) {
      Serial.printf("Time synchronized: %lu\n", (unsigned long)now);
    } else {
      Serial.println("Warning: NTP time sync failed, timestamps may be incorrect");
    }
  } else {
    Serial.println("\nFailed to connect to WiFi!");
    // Set LED to orange to indicate no WiFi
    setLedStatus(LED_STATUS_NO_WIFI);
  }
}

void initMeshCore() {
  Serial.println("Initializing MeshCore protocol stack...");
  Serial.printf("Free heap before init: %d bytes\n", ESP.getFreeHeap());
  
#ifdef HAS_LORA_RADIO
  // LoRa mode: Use built-in SX1262 radio
  LoRaTransport::Config config;
  config.pinNss = LORA_NSS;
  config.pinDio1 = LORA_DIO1;
  config.pinRst = LORA_RST;
  config.pinBusy = LORA_BUSY;
  config.pinMosi = LORA_MOSI;
  config.pinMiso = LORA_MISO;
  config.pinSck = LORA_SCK;
  config.frequency = LORA_FREQUENCY;
  config.bandwidth = LORA_BANDWIDTH;
  config.spreadingFactor = LORA_SPREADING_FACTOR;
  config.codingRate = LORA_CODING_RATE;
  config.syncWord = LORA_SYNC_WORD;
  config.txPower = LORA_TX_POWER;
  
  meshTransport = new LoRaTransport(config);
  meshCodec = new FrameCodec(*meshTransport);
  
  // Initialize the LoRa radio
  if (!meshTransport->init()) {
    Serial.println("ERROR: LoRa radio initialization failed");
    disconnectMeshCore();
    return;
  }
  
  Serial.println("MeshCore LoRa radio ready");
#else
  // BLE mode: Connect to external MeshCore device
  // Create the layered protocol stack
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  meshTransport = new BLECentralTransport(config);
  meshCodec = new FrameCodec(*meshTransport);
  meshProtocol = new CompanionProtocol(*meshTransport, *meshCodec);
  
  // Initialize and connect
  if (!meshTransport->init()) {
    Serial.println("ERROR: BLE initialization failed");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  if (!meshTransport->connect()) {
    Serial.println("MeshCore connection failed");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  // Start session
  if (!meshProtocol->startSession("ESP32-Uptime")) {
    Serial.println("MeshCore session start failed");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  // Find the configured channel
  uint8_t channelIdx;
  if (!meshProtocol->findChannelByName(BLE_MESH_CHANNEL_NAME, channelIdx)) {
    Serial.println("Channel not found");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  Serial.printf("MeshCore ready on channel %d\n", channelIdx);
#endif
}

bool ensureAuthenticated(AsyncWebServerRequest* request) {
  if (strlen(WEB_AUTH_USERNAME) == 0 || strlen(WEB_AUTH_PASSWORD) == 0) {
    return true;
  }

  if (request->authenticate(WEB_AUTH_USERNAME, WEB_AUTH_PASSWORD)) {
    return true;
  }

  request->requestAuthentication();
  return false;
}

void initFileSystem() {
  littleFsReady = false;

  // First attempt: try to mount without formatting
  if (LittleFS.begin(false)) {
    Serial.println("LittleFS mounted successfully");
    littleFsReady = true;
    return;
  }

  Serial.println("LittleFS mount failed, attempting format...");

  // Second attempt: begin(true) formats automatically on mount failure and
  // handles partition initialization internally, which is more reliable than
  // calling format() directly on corrupted or uninitialized flash.
  if (LittleFS.begin(true)) {
    Serial.println("LittleFS formatted and mounted successfully");
    littleFsReady = true;
    return;
  }

  Serial.println("LittleFS format via begin(true) failed, trying explicit format...");

  // Third attempt: explicit format for edge cases where begin(true) fails
  // This can happen if the partition table is misconfigured
  if (!LittleFS.format()) {
    Serial.println("LittleFS format failed! Check partition table and flash configuration.");
    Serial.println("Ensure a 'littlefs' data partition exists in partitions.csv and matches your flash size.");
    return;
  }

  Serial.println("LittleFS formatted successfully");

  // Now try to mount the freshly formatted filesystem
  if (!LittleFS.begin(false)) {
    Serial.println("Critical: Failed to mount LittleFS after successful format!");
    littleFsReady = false;
    return;
  }

  Serial.println("LittleFS mounted successfully after format");
  littleFsReady = true;
}

void disconnectMeshCore() {
  // Clear callbacks before cleanup to prevent use-after-free.
  // Callbacks could fire during disconnect/deinit and would reference deleted objects.
  if (meshCodec != nullptr) {
    meshCodec->clearCallbacks();
  }
  
#ifdef HAS_LORA_RADIO
  // LoRa mode: Deinitialize the radio
  if (meshCodec != nullptr) {
    delete meshCodec;
    meshCodec = nullptr;
  }
  
