bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  if (meshTransport != nullptr) {
    meshTransport->deinit();
    delete meshTransport;
    meshTransport = nullptr;
  }
  
  Serial.println("MeshCore LoRa radio deinitialized");
#else
  // BLE mode: Clean up the layered protocol stack
  if (meshProtocol != nullptr) {
    delete meshProtocol;
    meshProtocol = nullptr;
  }
  
  if (meshCodec != nullptr) {
    delete meshCodec;
    meshCodec = nullptr;
  }
  
  if (meshTransport != nullptr) {
    meshTransport->disconnect();
    meshTransport->deinit();
    delete meshTransport;
    meshTransport = nullptr;
  }
  
  Serial.println("MeshCore disconnected and deinitialized");
#endif
}

void disconnectWiFi() {
  Serial.println("Disconnecting WiFi for BLE operation...");
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);
  delay(100); // Allow WiFi to fully shut down
  Serial.println("WiFi disconnected");
}

void reconnectWiFi() {
  Serial.println("Reconnecting WiFi after BLE operation...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi reconnected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("\nFailed to reconnect to WiFi!");
  }
}

void initWebServer() {

  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
    if (!ensureAuthenticated(request)) {
      return;
    }
    request->send(200, "text/html", getWebPage());
  });

  server.on("/api/mesh/status", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["connected"] = isMeshDeviceConnected();
    doc["peerName"] = BLE_PEER_NAME;
    doc["deviceName"] = BLE_DEVICE_NAME;
    doc["channel"] = BLE_MESH_CHANNEL_NAME;
    doc["channelConfigured"] = isMeshChannelConfigured();
    doc["roomServerId"] = BLE_MESH_ROOM_SERVER_ID;
    doc["roomServerConfigured"] = isMeshRoomServerConfigured();
    doc["roomServerPasswordSet"] = strlen(BLE_MESH_ROOM_SERVER_PASSWORD) > 0;
    doc["channelReady"] = isMeshChannelReady();
    doc["protocolState"] = getMeshProtocolState();
    doc["lastError"] = getMeshLastError();
    doc["bleOperationInProgress"] = bleOperationInProgress;
    doc["pendingNotification"] = (bool)pendingMeshNotification;
    doc["monitoringPaused"] = monitoringPaused;

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  server.on("/api/mesh/send", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }

      // Check if a BLE operation is already in progress or queued
      if (bleOperationInProgress || pendingMeshNotification) {
        request->send(503, "application/json", "{\"error\":\"BLE operation already in progress\"}");
        return;
      }

      JsonDocument doc;
      if (deserializeJson(doc, data, len) != DeserializationError::Ok) {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
      }

      String title = doc["title"] | "Mesh Message";
      String message = doc["message"] | "";
      if (message.length() == 0) {
        request->send(400, "application/json", "{\"error\":\"Missing message\"}");
        return;
      }

      // Queue the notification to be processed in the main loop.
      // This prevents task watchdog timeouts by allowing the async web server
      // to fully complete HTTP response delivery before WiFi is disconnected
      // for BLE operations. The ESP32-S3 cannot run WiFi and BLE simultaneously,
      // so we must ensure the HTTP response is sent before switching to BLE.
      // Use noInterrupts()/interrupts() to ensure atomic write since the main
      // loop() reads these variables from a different FreeRTOS task context.
      noInterrupts();
      pendingMeshTitle = title;
      pendingMeshMessage = message;
      pendingMeshNotification = true;
      interrupts();
      
      request->send(202, "application/json", "{\"success\":true,\"status\":\"queued\"}");
    }
  );

  // get services
  server.on("/api/services", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    JsonArray array = doc["services"].to<JsonArray>();

    unsigned long currentTime = millis();

    for (int i = 0; i < serviceCount; i++) {
      if (services[i].lastCheck > 0) {
        services[i].secondsSinceLastCheck = (currentTime - services[i].lastCheck) / 1000;
      } else {
        services[i].secondsSinceLastCheck = -1; // Never checked
      }

      JsonObject obj = array.add<JsonObject>();
      obj["id"] = services[i].id;
      obj["name"] = services[i].name;
      obj["type"] = getServiceTypeString(services[i].type);
      obj["host"] = services[i].host;
      obj["port"] = services[i].port;
      obj["path"] = services[i].path;
      obj["url"] = services[i].url;
      obj["expectedResponse"] = services[i].expectedResponse;
      obj["checkInterval"] = services[i].checkInterval;
      obj["passThreshold"] = services[i].passThreshold;
      obj["failThreshold"] = services[i].failThreshold;
      obj["rearmCount"] = services[i].rearmCount;
      obj["consecutivePasses"] = services[i].consecutivePasses;
      obj["consecutiveFails"] = services[i].consecutiveFails;
      obj["failedChecksSinceAlert"] = services[i].failedChecksSinceAlert;
      obj["isUp"] = services[i].isUp;
      obj["secondsSinceLastCheck"] = services[i].secondsSinceLastCheck;
      obj["lastError"] = services[i].lastError;
      // SNMP-specific fields
      obj["snmpOid"] = services[i].snmpOid;
      obj["snmpCommunity"] = services[i].snmpCommunity;
      obj["snmpCompareOp"] = getSnmpCompareOpString(services[i].snmpCompareOp);
      obj["snmpExpectedValue"] = services[i].snmpExpectedValue;
      // Push-specific fields
      obj["pushToken"] = services[i].pushToken;
      // Enable/disable and pause fields
      obj["enabled"] = services[i].enabled;
      obj["pauseUntil"] = services[i].pauseUntil;
      // Calculate pause remaining time in seconds (rollover-safe)
      obj["pauseRemaining"] = getPauseRemainingMs(services[i].pauseUntil, currentTime) / 1000;
    }

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  // add service
  server.on("/api/services", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }
      if (serviceCount >= MAX_SERVICES) {
        request->send(400, "application/json", "{\"error\":\"Maximum services reached\"}");
        return;
      }

      JsonDocument doc;
      DeserializationError error = deserializeJson(doc, data, len);

      if (error) {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
      }

      Service newService;
      newService.id = generateServiceId();
      newService.name = doc["name"].as<String>();

      String typeStr = doc["type"].as<String>();
      if (typeStr == "http_get") {
        newService.type = TYPE_HTTP_GET;
      } else if (typeStr == "ping") {
        newService.type = TYPE_PING;
      } else if (typeStr == "snmp_get") {
        newService.type = TYPE_SNMP_GET;
      } else if (typeStr == "port") {
        newService.type = TYPE_PORT;
      } else if (typeStr == "push") {
        newService.type = TYPE_PUSH;
      } else {
        request->send(400, "application/json", "{\"error\":\"Invalid service type\"}");
        return;
      }

      newService.host = doc["host"].as<String>();
      newService.port = doc["port"] | 80;
      newService.path = doc["path"] | "/";
      newService.url = doc["url"].as<String>();
      newService.expectedResponse = doc["expectedResponse"] | "*";
      newService.checkInterval = doc["checkInterval"] | 60;

      int passThreshold = doc["passThreshold"] | 1;
      if (passThreshold < 1) passThreshold = 1;
      newService.passThreshold = passThreshold;

      int failThreshold = doc["failThreshold"] | 3;
      if (failThreshold < 1) failThreshold = 1;
      newService.failThreshold = failThreshold;

      int rearmCount = doc["rearmCount"] | 1440;
      if (rearmCount < 0) rearmCount = 0;
      newService.rearmCount = rearmCount;

      // SNMP-specific fields
      newService.snmpOid = doc["snmpOid"] | "";
      newService.snmpCommunity = doc["snmpCommunity"] | "public";
      String compareOpStr = doc["snmpCompareOp"] | "=";
      newService.snmpCompareOp = parseSnmpCompareOp(compareOpStr);
      newService.snmpExpectedValue = doc["snmpExpectedValue"] | "";

      // Push-specific fields
      if (newService.type == TYPE_PUSH) {
        // Use provided pushToken if available (for editing), otherwise generate new one
        String providedToken = doc["pushToken"] | "";
        if (providedToken.length() > 0) {
          newService.pushToken = providedToken;
        } else {
          newService.pushToken = generatePushToken();
        }
      } else {
        newService.pushToken = "";
      }
      newService.lastPush = 0;

      newService.consecutivePasses = 0;
      newService.consecutiveFails = 0;
      newService.failedChecksSinceAlert = 0;
      newService.isUp = false;
      newService.hasBeenUp = false;
      newService.lastCheck = 0;
      newService.lastUptime = 0;
      newService.lastError = "";
      newService.secondsSinceLastCheck = -1;
      // Enable/disable and pause fields
      newService.enabled = true;
      newService.pauseUntil = 0;

      services[serviceCount++] = newService;
      saveServices();

