bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
      int importedCount = 0;
      int skippedCount = 0;

      for (JsonObject obj : array) {
        if (serviceCount >= MAX_SERVICES) {
          skippedCount++;
          continue;
        }

        // Validate required fields
        String name = obj["name"].as<String>();
        String host = obj["host"].as<String>();
        String typeStr = obj["type"].as<String>();
        
        // Push type doesn't require host
        if (name.length() == 0) {
          skippedCount++;
          continue;
        }
        
        // Non-push types require host
        if (typeStr != "push" && host.length() == 0) {
          skippedCount++;
          continue;
        }

        ServiceType type;
        if (typeStr == "http_get") {
          type = TYPE_HTTP_GET;
        } else if (typeStr == "ping") {
          type = TYPE_PING;
        } else if (typeStr == "snmp_get") {
          type = TYPE_SNMP_GET;
        } else if (typeStr == "port") {
          type = TYPE_PORT;
        } else if (typeStr == "push") {
          type = TYPE_PUSH;
        } else {
          skippedCount++;
          continue;
        }

        // Validate and constrain numeric values
        int port = obj["port"] | 80;
        if (port < 1 || port > 65535) port = 80;

        int checkInterval = obj["checkInterval"] | 60;
        if (checkInterval < 10) checkInterval = 10;

        int passThreshold = obj["passThreshold"] | 1;
        if (passThreshold < 1) passThreshold = 1;

        int failThreshold = obj["failThreshold"] | 3;
        if (failThreshold < 1) failThreshold = 1;

        int rearmCount = obj["rearmCount"] | 1440;
        if (rearmCount < 0) rearmCount = 0;

        Service newService;
        newService.id = generateServiceId();
        newService.name = name;
        newService.type = type;
        newService.host = host;
        newService.port = port;
        newService.path = obj["path"] | "/";
        newService.url = obj["url"] | "";
        // Backward compatibility: generate URL from host/port/path if URL is empty
        if (newService.url.length() == 0 && type == TYPE_HTTP_GET && host.length() > 0) {
          String protocol = (port == 443) ? "https://" : "http://";
          newService.url = protocol + host + ":" + String(port) + newService.path;
        }
        newService.expectedResponse = obj["expectedResponse"] | "*";
        newService.checkInterval = checkInterval;
        newService.passThreshold = passThreshold;
        newService.failThreshold = failThreshold;
        newService.rearmCount = rearmCount;
        // SNMP-specific fields
        newService.snmpOid = obj["snmpOid"] | "";
        newService.snmpCommunity = obj["snmpCommunity"] | "public";
        String compareOpStr = obj["snmpCompareOp"] | "=";
        newService.snmpCompareOp = parseSnmpCompareOp(compareOpStr);
        newService.snmpExpectedValue = obj["snmpExpectedValue"] | "";
        // Push-specific fields - generate new token on import for security
        if (type == TYPE_PUSH) {
          newService.pushToken = generatePushToken();
        } else {
          newService.pushToken = "";
        }
        newService.lastPush = 0;
        newService.consecutivePasses = 0;
        newService.consecutiveFails = 0;
        newService.failedChecksSinceAlert = 0;
        newService.isUp = false;
        newService.hasBeenUp = false;
        newService.lastCheck = 0;
        newService.lastUptime = 0;
        newService.lastError = "";
        newService.secondsSinceLastCheck = -1;
        // Enable/disable and pause fields - import as enabled and not paused
        newService.enabled = true;
        newService.pauseUntil = 0;

        services[serviceCount++] = newService;
        importedCount++;
      }

      saveServices();

      JsonDocument response;
      response["success"] = true;
      response["imported"] = importedCount;
      response["skipped"] = skippedCount;

      String responseStr;
      serializeJson(response, responseStr);
      request->send(200, "application/json", responseStr);
    }
  );

  // Push endpoint for push-based monitoring
  // Clients send a GET request to /api/push/{token} to register a check pass
  server.on("/api/push/*", HTTP_GET, [](AsyncWebServerRequest *request) {
    String path = request->url();
    String token = path.substring(path.lastIndexOf('/') + 1);
    
    if (token.length() == 0) {
      request->send(400, "application/json", "{\"error\":\"Missing token\"}");
      return;
    }
    
    // Find the service with this push token
    bool found = false;
    for (int i = 0; i < serviceCount; i++) {
      if (services[i].type == TYPE_PUSH && services[i].pushToken == token) {
        unsigned long now = millis();
        services[i].lastPush = now;
        bool wasUp = services[i].isUp;

        // Mark the service as passing immediately
        services[i].lastCheck = now;
        services[i].lastUptime = now;
        services[i].secondsSinceLastCheck = 0;
        services[i].consecutiveFails = 0;
        services[i].failedChecksSinceAlert = 0;
        services[i].lastError = "";

        int requiredPasses = services[i].passThreshold >= 1 ? services[i].passThreshold : 1;
        services[i].consecutivePasses = requiredPasses;
        services[i].isUp = true;

        if (!wasUp) {
          Serial.printf("Push service '%s' marked UP immediately\n", services[i].name.c_str());

#ifdef HAS_LCD
          displayNeedsUpdate = true;
#endif

          if (services[i].hasBeenUp) {
            sendOnlineNotification(services[i]);
          }
          services[i].hasBeenUp = true;
        }
        found = true;
        Serial.printf("Push received for service '%s'\n", services[i].name.c_str());
        
        JsonDocument response;
        response["success"] = true;
        response["service"] = services[i].name;
        response["timestamp"] = services[i].lastPush;
        
        String responseStr;
        serializeJson(response, responseStr);
        request->send(200, "application/json", responseStr);
        return;
      }
    }
    
