bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  int httpCode = http.POST(payload);

  if (httpCode > 0) {
    Serial.printf("Discord notification sent: %d\n", httpCode);
  } else {
    Serial.printf("Failed to send Discord notification: %d\n", httpCode);
  }

  http.end();
}

void sendMeshCoreNotification(const String& title, const String& message) {
#ifdef HAS_LORA_RADIO
  // LoRa mode: Send directly using the built-in radio
  // No WiFi/radio coexistence issues - both can run simultaneously
  
  Serial.println("Starting MeshCore notification (LoRa)...");
  
  // Build the message: combine title and message
  String fullMessage = title + ": " + message;
  
  // If transport not initialized, create it now
  if (meshTransport == nullptr) {
    LoRaTransport::Config config;
    config.pinNss = LORA_NSS;
    config.pinDio1 = LORA_DIO1;
    config.pinRst = LORA_RST;
    config.pinBusy = LORA_BUSY;
    config.pinMosi = LORA_MOSI;
    config.pinMiso = LORA_MISO;
    config.pinSck = LORA_SCK;
    config.frequency = LORA_FREQUENCY;
    config.bandwidth = LORA_BANDWIDTH;
    config.spreadingFactor = LORA_SPREADING_FACTOR;
    config.codingRate = LORA_CODING_RATE;
    config.syncWord = LORA_SYNC_WORD;
    config.txPower = LORA_TX_POWER;
    
    meshTransport = new LoRaTransport(config);
    meshCodec = new FrameCodec(*meshTransport);
    
    if (!meshTransport->init()) {
      Serial.println("ERROR: LoRa radio initialization failed");
      delete meshCodec;
      meshCodec = nullptr;
      delete meshTransport;
      meshTransport = nullptr;
      return;
    }
  }
  
  // Build MeshCore packet for channel message
  // Format: CMD_SEND_CHANNEL_TXT_MSG(1) + txt_type(1) + channel_index(1) + timestamp(4) + text
  // For LoRa broadcast, we use channel index 0 (default public channel)
  std::vector<uint8_t> payload;
  const uint8_t CMD_SEND_CHANNEL_TXT_MSG = 3;
  const uint8_t TXT_TYPE_PLAIN = 0;
  const uint8_t channelIndex = 0;  // Default channel for broadcast
  
  payload.push_back(TXT_TYPE_PLAIN);
  payload.push_back(channelIndex);
  
  // Timestamp (little-endian, 4 bytes)
  time_t now = time(nullptr);
  uint32_t timestamp = static_cast<uint32_t>(now);
  payload.push_back(static_cast<uint8_t>(timestamp & 0xFF));
  payload.push_back(static_cast<uint8_t>((timestamp >> 8) & 0xFF));
  payload.push_back(static_cast<uint8_t>((timestamp >> 16) & 0xFF));
  payload.push_back(static_cast<uint8_t>((timestamp >> 24) & 0xFF));
  
  // Message text
  size_t textLen = fullMessage.length();
  if (textLen > 140) textLen = 140;  // MeshCore max message length
  payload.insert(payload.end(), fullMessage.begin(), fullMessage.begin() + textLen);
  
  // Send using frame codec
  if (meshCodec->sendFrame(CMD_SEND_CHANNEL_TXT_MSG, payload)) {
    Serial.println("MeshCore LoRa notification sent successfully");
  } else {
    Serial.printf("MeshCore LoRa notification failed: %s\n", meshTransport->getLastError().c_str());
  }
  
#else
  // BLE mode: ESP32-S3 cannot run WiFi and BLE simultaneously
  // Disconnect WiFi, connect BLE, send message, disconnect BLE, reconnect WiFi
  
  Serial.println("Starting MeshCore notification (BLE operation)...");
  
  // Pause monitoring to prevent false positives during network transition
  monitoringPaused = true;
  bleOperationInProgress = true;
  
  // Disconnect WiFi before starting BLE
  disconnectWiFi();
  
  // Create the layered protocol stack on heap to reduce stack usage.
  // Stack overflow can occur when these large objects are combined with
  // deep BLE callback chains during sendTextMessageToChannel.
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  BLECentralTransport* transport = new BLECentralTransport(config);
  FrameCodec* codec = new FrameCodec(*transport);
  CompanionProtocol* protocol = new CompanionProtocol(*transport, *codec);
  
  bool success = false;
  
  // Initialize and connect
  if (transport->init()) {
    if (transport->connect()) {
      // Start session
      if (protocol->startSession("ESP32-Uptime")) {
        // Find the configured channel
        uint8_t channelIdx;
        if (protocol->findChannelByName(BLE_MESH_CHANNEL_NAME, channelIdx)) {
          // Build the message: combine title and message
          String fullMessage = title + ": " + message;
          
          // Send using the protocol layer
          if (protocol->sendTextMessageToChannel(channelIdx, fullMessage)) {
            Serial.println("MeshCore notification sent successfully");
            success = true;
          } else {
            Serial.printf("MeshCore notification failed: send error - %s\n", protocol->getLastError().c_str());
          }
        } else {
          Serial.printf("MeshCore notification skipped: channel not found - %s\n", protocol->getLastError().c_str());
        }
      } else {
        Serial.printf("MeshCore notification skipped: session start failed - %s\n", protocol->getLastError().c_str());
      }
    } else {
      Serial.printf("MeshCore notification skipped: not connected - %s\n", transport->getLastError().c_str());
    }
  } else {
    Serial.printf("MeshCore notification skipped: BLE init failed - %s\n", transport->getLastError().c_str());
  }
  
  // Clear callbacks before cleanup to prevent use-after-free.
  // BLE callbacks could fire during disconnect/deinit and would reference deleted objects.
  codec->clearCallbacks();
  
  // Disconnect BLE and deinitialize to free resources
  transport->disconnect();
  transport->deinit();
  
  // Clean up heap-allocated objects
  delete protocol;
  delete codec;
  delete transport;
  
  // Reconnect WiFi
  reconnectWiFi();
  
  // Resume monitoring
  bleOperationInProgress = false;
  monitoringPaused = false;
  
  Serial.println("MeshCore notification operation complete");
#endif
}

String base64Encode(const String& input) {
  size_t outputLength = 0;
  size_t bufferLength = ((input.length() + 2) / 3) * 4 + 4;
  unsigned char* output = new unsigned char[bufferLength];

  int result = mbedtls_base64_encode(
    output,
    bufferLength,
    &outputLength,
    reinterpret_cast<const unsigned char*>(input.c_str()),
    input.length()
  );

  String encoded = "";
  if (result == 0) {
    encoded = String(reinterpret_cast<char*>(output), outputLength);
  }

  delete[] output;
  return encoded;
}

bool readSmtpResponse(WiFiClient& client, int expectedCode) {
  unsigned long timeout = millis() + 5000;
  String line;
  int code = -1;

  do {
    while (!client.available() && millis() < timeout) {
      delay(10);
    }

    if (!client.available()) {
      Serial.println("SMTP response timeout");
      return false;
    }

    line = client.readStringUntil('\n');
    line.trim();
    if (line.length() >= 3) {
      code = line.substring(0, 3).toInt();
    }
  } while (line.length() >= 4 && line.charAt(3) == '-');

