bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  if (!sendSmtpCommand(*client, "DATA", 354)) { client->stop(); return false; }

  client->printf("From: <%s>\r\n", SMTP_FROM_ADDRESS);
  client->printf("To: %s\r\n", SMTP_TO_ADDRESS);
  client->printf("Subject: %s\r\n", title.c_str());
  client->println("Content-Type: text/plain; charset=\"UTF-8\"\r\n");
  client->println(message);
  client->println(".");

  if (!readSmtpResponse(*client, 250)) { client->stop(); return false; }
  sendSmtpCommand(*client, "QUIT", 221);
  client->stop();

  Serial.println("SMTP notification sent");
  return true;
}

bool sendMeshCoreNotificationWithStatus(const String& title, const String& message) {
#ifdef HAS_LORA_RADIO
  // LoRa mode: Send directly using the built-in radio
  // No WiFi/radio coexistence issues - both can run simultaneously
  
  Serial.println("Starting MeshCore notification (LoRa)...");
  
  // Set LED to white to indicate MeshCore communication
  setLedStatus(LED_STATUS_MESHCORE);
  
  // Build the message: combine title and message
  String fullMessage = title + ": " + message;
  
  // If transport not initialized, create it now
  if (meshTransport == nullptr) {
    LoRaTransport::Config config;
    config.pinNss = LORA_NSS;
    config.pinDio1 = LORA_DIO1;
    config.pinRst = LORA_RST;
    config.pinBusy = LORA_BUSY;
    config.pinMosi = LORA_MOSI;
    config.pinMiso = LORA_MISO;
    config.pinSck = LORA_SCK;
    config.frequency = LORA_FREQUENCY;
    config.bandwidth = LORA_BANDWIDTH;
    config.spreadingFactor = LORA_SPREADING_FACTOR;
    config.codingRate = LORA_CODING_RATE;
    config.syncWord = LORA_SYNC_WORD;
    config.txPower = LORA_TX_POWER;
    
    meshTransport = new LoRaTransport(config);
    meshCodec = new FrameCodec(*meshTransport);
    
    if (!meshTransport->init()) {
      Serial.println("ERROR: LoRa radio initialization failed");
      delete meshCodec;
      meshCodec = nullptr;
      delete meshTransport;
      meshTransport = nullptr;
      return false;
    }
  }
  
  // Build MeshCore packet for channel message
  // Format: CMD_SEND_CHANNEL_TXT_MSG(1) + txt_type(1) + channel_index(1) + timestamp(4) + text
  // For LoRa broadcast, we use channel index 0 (default public channel)
  std::vector<uint8_t> payload;
  const uint8_t CMD_SEND_CHANNEL_TXT_MSG = 3;
  const uint8_t TXT_TYPE_PLAIN = 0;
  const uint8_t channelIndex = 0;  // Default channel for broadcast
  
  payload.push_back(TXT_TYPE_PLAIN);
  payload.push_back(channelIndex);
  
  // Timestamp (little-endian, 4 bytes)
  time_t now = time(nullptr);
  uint32_t timestamp = static_cast<uint32_t>(now);
  payload.push_back(static_cast<uint8_t>(timestamp & 0xFF));
  payload.push_back(static_cast<uint8_t>((timestamp >> 8) & 0xFF));
  payload.push_back(static_cast<uint8_t>((timestamp >> 16) & 0xFF));
  payload.push_back(static_cast<uint8_t>((timestamp >> 24) & 0xFF));
  
  // Message text
  size_t textLen = fullMessage.length();
  if (textLen > 140) textLen = 140;  // MeshCore max message length
  payload.insert(payload.end(), fullMessage.begin(), fullMessage.begin() + textLen);
  
  // Send using frame codec
  bool success = meshCodec->sendFrame(CMD_SEND_CHANNEL_TXT_MSG, payload);
  if (success) {
    Serial.println("MeshCore LoRa notification sent successfully");
  } else {
    Serial.printf("MeshCore LoRa notification failed: %s\n", meshTransport->getLastError().c_str());
  }
  
  return success;
  
#else
  // BLE mode: ESP32-S3 cannot run WiFi and BLE simultaneously
  // Disconnect WiFi, connect BLE, send message, disconnect BLE, reconnect WiFi
  
  Serial.println("Starting MeshCore notification (BLE operation)...");
  
  // Set LED to white to indicate MeshCore communication
  setLedStatus(LED_STATUS_MESHCORE);
  
  // Pause monitoring to prevent false positives during network transition
  monitoringPaused = true;
  bleOperationInProgress = true;
  
  // Disconnect WiFi before starting BLE
  disconnectWiFi();
  
  // Create the layered protocol stack on heap to reduce stack usage.
  // Stack overflow can occur when these large objects are combined with
  // deep BLE callback chains during sendTextMessageToChannel.
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  BLECentralTransport* transport = new BLECentralTransport(config);
  FrameCodec* codec = new FrameCodec(*transport);
  CompanionProtocol* protocol = new CompanionProtocol(*transport, *codec);
  
  bool success = false;
  bool channelSent = false;
  bool roomServerSent = false;
  
  // Initialize and connect
  if (transport->init()) {
    if (transport->connect()) {
      // Start session
      if (protocol->startSession("ESP32-Uptime")) {
        // Build the message: combine title and message
        String fullMessage = title + ": " + message;
        
        // Send to channel if configured
        if (isMeshChannelConfigured()) {
          uint8_t channelIdx;
          if (protocol->findChannelByName(BLE_MESH_CHANNEL_NAME, channelIdx)) {
            if (protocol->sendTextMessageToChannel(channelIdx, fullMessage)) {
              Serial.println("MeshCore channel notification sent successfully");
              channelSent = true;
            } else {
              Serial.printf("MeshCore channel notification failed: send error - %s\n", protocol->getLastError().c_str());
            }
          } else {
            Serial.printf("MeshCore channel notification skipped: channel not found - %s\n", protocol->getLastError().c_str());
          }
        }
        
        // Send to room server if configured
        if (isMeshRoomServerConfigured()) {
          if (protocol->sendTextMessageToContact(BLE_MESH_ROOM_SERVER_ID, fullMessage, BLE_MESH_ROOM_SERVER_PASSWORD)) {
            Serial.println("MeshCore room server notification sent successfully");
            roomServerSent = true;
          } else {
            Serial.printf("MeshCore room server notification failed: send error - %s\n", protocol->getLastError().c_str());
          }
        }
        
