bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
            if (type === 'http_get') {
                // HTTP GET uses URL field only
                hostGroup.classList.add('hidden');
                hostInput.removeAttribute('required');
                urlGroup.classList.remove('hidden');
                urlInput.setAttribute('required', '');
                portGroup.classList.add('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.remove('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
            } else if (type === 'push') {
                // Push type doesn't need host/port/path/url
                hostGroup.classList.add('hidden');
                hostInput.removeAttribute('required');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.add('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
            } else if (type === 'ping') {
                hostGroup.classList.remove('hidden');
                hostInput.setAttribute('required', '');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.add('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
            } else if (type === 'port') {
                hostGroup.classList.remove('hidden');
                hostInput.setAttribute('required', '');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.remove('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
                portInput.value = 22;
            } else if (type === 'snmp_get') {
                hostGroup.classList.remove('hidden');
                hostInput.setAttribute('required', '');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.remove('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.remove('hidden');
                snmpCommunityGroup.classList.remove('hidden');
                snmpCompareGroup.classList.remove('hidden');
                portInput.value = 161;
            }
        });

        // Add service
        document.getElementById('addServiceForm').addEventListener('submit', async function(e) {
            e.preventDefault();

            const data = {
                name: document.getElementById('serviceName').value,
                type: document.getElementById('serviceType').value,
                host: document.getElementById('serviceHost').value,
                port: parseInt(document.getElementById('servicePort').value) || 80,
                path: document.getElementById('servicePath').value,
                url: document.getElementById('serviceUrl').value,
                expectedResponse: document.getElementById('expectedResponse').value,
                checkInterval: parseInt(document.getElementById('checkInterval').value),
                passThreshold: parseInt(document.getElementById('passThreshold').value),
                failThreshold: parseInt(document.getElementById('failThreshold').value),
                rearmCount: parseInt(document.getElementById('rearmCount').value),
                snmpOid: document.getElementById('snmpOid').value,
                snmpCommunity: document.getElementById('snmpCommunity').value,
                snmpCompareOp: document.getElementById('snmpCompareOp').value,
                snmpExpectedValue: document.getElementById('snmpExpectedValue').value
            };

            // Preserve pushToken when editing a PUSH service
            if (editingPushToken && data.type === 'push') {
                data.pushToken = editingPushToken;
            }

            try {
                const response = await fetch('/api/services', {
                    method: 'POST',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify(data)
                });

                if (response.ok) {
                    showAlert('Service added successfully!', 'success');
                    this.reset();
                    editingPushToken = null;  // Clear the stored pushToken
                    document.getElementById('serviceType').dispatchEvent(new Event('change'));
                    loadServices();
                } else {
                    showAlert('Failed to add service', 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }
        });

        // Load services
        async function loadServices() {
            try {
                const response = await fetch('/api/services');
                const data = await response.json();
                services = data.services || [];
                renderServices();
            } catch (error) {
                console.error('Error loading services:', error);
            }
        }

        // Render services
        function renderServices() {
            const container = document.getElementById('servicesContainer');
            const emptyState = document.getElementById('emptyState');

            if (services.length === 0) {
                container.innerHTML = '';
                emptyState.classList.remove('hidden');
                return;
            }

            emptyState.classList.add('hidden');

