bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
            container.innerHTML = services.map(service => {
                let uptimeStr = 'Not checked yet';

                if (service.secondsSinceLastCheck >= 0) {
                    const seconds = service.secondsSinceLastCheck;
                    if (seconds < 60) {
                        uptimeStr = `${seconds}s ago`;
                    } else if (seconds < 3600) {
                        const minutes = Math.floor(seconds / 60);
                        const secs = seconds % 60;
                        uptimeStr = `${minutes}m ${secs}s ago`;
                    } else {
                        const hours = Math.floor(seconds / 3600);
                        const minutes = Math.floor((seconds % 3600) / 60);
                        uptimeStr = `${hours}h ${minutes}m ago`;
                    }
                }

                const rearmInfo = service.rearmCount > 0 
                    ? `${service.rearmCount} (${service.failedChecksSinceAlert} since last alert)` 
                    : 'disabled';

                // Build SNMP info section if applicable
                let snmpInfo = '';
                if (service.type === 'snmp_get' && service.snmpOid) {
                    snmpInfo = `
                        <div class="service-info">
                            <strong>OID:</strong> ${service.snmpOid}
                        </div>
                        <div class="service-info">
                            <strong>Community:</strong> ${service.snmpCommunity}
                        </div>
                        <div class="service-info">
                            <strong>Check:</strong> value ${service.snmpCompareOp} ${service.snmpExpectedValue}
                        </div>
                    `;
                }

                // Build push info section if applicable
                let pushInfo = '';
                if (service.type === 'push' && service.pushToken) {
                    const pushUrl = window.location.origin + '/api/push/' + service.pushToken;
                    pushInfo = `
                        <div class="service-info">
                            <strong>Push URL:</strong> <code style="font-size: 0.85em; background: #f3f4f6; padding: 2px 6px; border-radius: 4px; word-break: break-all;">${pushUrl}</code>
                        </div>
                    `;
                }

                // Build URL info for http_get type
                let urlInfo = '';
                if (service.type === 'http_get' && service.url) {
                    urlInfo = `
                        <div class="service-info">
                            <strong>URL:</strong> <span style="word-break: break-all;">${service.url}</span>
                        </div>
                    `;
                }

                // Build host info - not applicable for push or http_get type
                let hostInfo = '';
                if (service.type !== 'push' && service.type !== 'http_get') {
                    hostInfo = `
                        <div class="service-info">
                            <strong>Host:</strong> ${service.host}${service.type !== 'ping' ? ':' + service.port : ''}
                        </div>
                    `;
                }

                // Build status info for enabled/paused state
                let statusInfo = '';
                if (!service.enabled) {
                    statusInfo = '<div class="service-info" style="color: #6b7280;"><strong>Status:</strong> Disabled</div>';
                } else if (service.pauseRemaining > 0) {
                    const pauseMins = Math.floor(service.pauseRemaining / 60);
                    const pauseSecs = service.pauseRemaining % 60;
                    const pauseStr = pauseMins > 0 ? `${pauseMins}m ${pauseSecs}s` : `${pauseSecs}s`;
                    statusInfo = `<div class="service-info" style="color: #f59e0b;"><strong>Status:</strong> Paused (${pauseStr} remaining)</div>`;
                }

                // Determine if service is pending (never checked)
                const isPending = service.secondsSinceLastCheck < 0;

                // Determine service card class based on enabled/paused/pending state
                let cardClass = service.isUp ? 'up' : 'down';
                if (isPending) {
                    cardClass = 'pending';
                }
                if (!service.enabled || service.pauseRemaining > 0) {
                    cardClass = 'paused';
                }

                // Determine status text and class
                let statusText = service.isUp ? 'UP' : 'DOWN';
                let statusClass = service.isUp ? 'up' : 'down';
                if (isPending) {
                    statusText = 'PENDING';
                    statusClass = 'pending';
                }

                return `
                    <div class="service-card ${cardClass}">
                        <div class="service-header">
                            <div>
                                <div class="service-name">${service.name}</div>
                                <div class="type-badge">${service.type.replace('_', ' ').toUpperCase()}</div>
                            </div>
                            <span class="service-status ${statusClass}">
                                ${statusText}
                            </span>
                        </div>
                        ${statusInfo}
                        ${urlInfo}
                        ${hostInfo}
                        ${snmpInfo}
                        ${pushInfo}
                        <div class="service-info">
                            <strong>Check Interval:</strong> ${service.checkInterval}s
                        </div>
                        <div class="service-info">
                            <strong>Thresholds:</strong> ${service.failThreshold} fail / ${service.passThreshold} pass
                        </div>
                        <div class="service-info">
                            <strong>Re-arm Alert:</strong> ${rearmInfo}
                        </div>
                        <div class="service-info">
                            <strong>Consecutive:</strong> ${service.consecutivePasses} passes / ${service.consecutiveFails} fails
                        </div>
                        <div class="service-info">
                            <strong>Last Check:</strong> ${uptimeStr}
                        </div>
                        ${service.lastError ? `
                        <div class="service-info" style="color: #ef4444;">
                            <strong>Error:</strong> ${service.lastError}
                        </div>
                        ` : ''}
                        <div class="service-actions">
                            <button class="btn btn-secondary" onclick="editService('${service.id}')">Edit</button>
                            ${service.enabled 
                                ? `<button class="btn btn-secondary" onclick="toggleService('${service.id}', false)">Disable</button>`
                                : `<button class="btn btn-primary" onclick="toggleService('${service.id}', true)">Enable</button>`
                            }
                            ${service.pauseRemaining > 0
                                ? `<button class="btn btn-secondary" onclick="pauseService('${service.id}', 0)">Unpause</button>`
                                : `<button class="btn btn-secondary" onclick="showPauseDialog('${service.id}')">Pause</button>`
                            }
                            <button class="btn btn-danger" onclick="deleteService('${service.id}')">Delete</button>
                        </div>
                    </div>
                `;
            }).join('');
        }

